In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})


dframe

  k1     k2  dataset1  dataset2
0  X  alpha -2.330687  0.583314
1  X   beta  0.437502  1.625311
2  Y  alpha -0.982498 -0.177003
3  Y   beta  0.360542  0.672919
4  Z  alpha  1.717147  1.084425

In [3]:
# using group by to create a series groupby object

In [5]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [6]:
group1

In [8]:
group1.mean()

k1
X   -0.946593
Y   -0.310978
Z    1.717147
Name: dataset1, dtype: float64

In [9]:
cities = np.array(['NY','LA','LA','NY','NY'])

month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [10]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.437502
    JAN   -0.982498
NY  FEB    0.360542
    JAN   -0.306770
Name: dataset1, dtype: float64

In [11]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -2.330687  0.583314
1  X   beta  0.437502  1.625311
2  Y  alpha -0.982498 -0.177003
3  Y   beta  0.360542  0.672919
4  Z  alpha  1.717147  1.084425

In [12]:
#passing column names as group keys

In [14]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.946593  1.104312
Y  -0.310978  0.247958
Z   1.717147  1.084425

In [15]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -2.330687  0.583314
   beta   0.437502  1.625311
Y  alpha -0.982498 -0.177003
   beta   0.360542  0.672919
Z  alpha  1.717147  1.084425

In [16]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [17]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -2.330687  0.583314
1  X   beta  0.437502  1.625311
2  Y  alpha -0.982498 -0.177003
3  Y   beta  0.360542  0.672919
4  Z  alpha  1.717147  1.084425

In [19]:
for name,group in dframe.groupby('k1'):
    print( 'This is the %s group' %name)
    print( group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -2.330687  0.583314
1  X   beta  0.437502  1.625311


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.982498 -0.177003
3  Y   beta  0.360542  0.672919


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  1.717147  1.084425

In [24]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print("Key1 = %s Key2 = %s" %(k1,k2))
    print (group)
    print('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha -2.330687  0.583314


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  0.437502  1.625311


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.982498 -0.177003


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.360542  0.672919


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  1.717147  1.084425

In [21]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -2.330687  0.583314
1  X   beta  0.437502  1.625311
2  Y  alpha -0.982498 -0.177003
3  Y   beta  0.360542  0.672919
4  Z  alpha  1.717147  1.084425

In [25]:
#creating a dictionery of the data peices

In [26]:
group_dict = dict(list(dframe.groupby('k1')))

In [28]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -2.330687  0.583314
1  X   beta  0.437502  1.625311

In [30]:
group_dict

{'X':   k1     k2  dataset1  dataset2
 0  X  alpha -2.330687  0.583314
 1  X   beta  0.437502  1.625311, 'Y':   k1     k2  dataset1  dataset2
 2  Y  alpha -0.982498 -0.177003
 3  Y   beta  0.360542  0.672919, 'Z':   k1     k2  dataset1  dataset2
 4  Z  alpha  1.717147  1.084425}

In [31]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [32]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -2.330687  0.583314
 1  0.437502  1.625311
 2 -0.982498 -0.177003
 3  0.360542  0.672919
 4  1.717147  1.084425, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [33]:
#using group by with columns

In [34]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.583314
   beta   1.625311
Y  alpha -0.177003
   beta   0.672919
Z  alpha  1.084425